result_artillery_with_log.txt
Started phase 0, duration: 1s @ 21:37:10(-0400) 2021-08-26
Report @ 21:37:12(-0400) 2021-08-26
Elapsed time: 2 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  1000
  Mean response/sec: 403.23
  Response time (msec):
    min: 2
    max: 54
    median: 32
    p95: 46
    p99: 50.5
  Codes:
    200: 1000

All virtual users finished
Summary report @ 21:37:12(-0400) 2021-08-26
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  1000
  Mean response/sec: 401.61
  Response time (msec):
    min: 2
    max: 54
    median: 32
    p95: 46
    p99: 50.5
  Scenario counts:
    0: 20 (100%)
  Codes:
    200: 1000